### DS102 | In Class Practice Week 2C - Categorical Analysis
<hr>
## Learning Objectives
At the end of the lesson, you will be able to:

### In Class Content
At the end of the lesson, you will be able to:

- use a `GroupBy` object to aggregate data, retrieving the `size()` of aggregated records

- create a `GroupBy` object, aggregating two columns

- use `rename()` to change the name of columns

- perform data cleaning using `replace()`

- use `apply()` on `numpy` functions like `numpy.int` and `numpy.float`

- use `drop` to remove one column from a `DataFrame`

### Self Study Content
At the end of your self-study, you will be able to:

- create a pivot table using  `pandas.pivot_table` to see aggregates in rows and columns

- update column names using `pandas.Index`

### Datasets Required for this In Class
1. `travel-expenses.csv`

#### import `pandas` and `numpy`

In [1]:
# Import the libraries
import pandas as pd
import numpy as np

#### read from CSV to `df`
Read the dataset `travel-expenses.csv` into a `df`.

In [2]:
# Read the dataset into a df
df = pd.read_csv('travel-expenses.csv')

Use `df.info()` and `df.head()` to get key properties of the `df`.

In [7]:
# Exercise: Use df.info() to get key properties of the df
df.describe(include = 'all')

,Name,Start date of trip,Duration of Visit,Destination,Purpose of trip,Mode of transport,Class of travel,Accomodation/Meals,Other (including hospitality given),"Total cost, including all visas, accommodation, travel, meals etc. (£)",Total Cost of Use of Official Secure Car
count,147,147,147,147,147,147,147,147,147,147,147
unique,42,63,12,92,120,12,19,62,36,136,2
top,Angus Lapsley,2018-03-15,2,Brussels,Nil Return,Air,Economy,Nil Return,Nil Return,Nil Return,Nil Return
freq,11,15,54,14,8,72,81,79,107,8,142

For easier manipulation, first `rename` the columns. Use `inplace=True` so that this does not create another copy of the `df`. `columns` takes a dictionary where the key is the existing column name and the target is the new column name.

In [8]:
# Rename the columns accordingly. 
display(df.head(1))
df.rename(inplace=True, columns={
 'Accomodation/Meals': 'Accommodation and Meals', 
 'Other (including hospitality given)' : 'Other',
 'Total cost, including all visas, accommodation, travel, meals etc. (£)' : 'Total cost',
})
# How many columns are being renamed?
# (Type your answer here) 3

# Exercise: What is the datatype of the columns parameter?
# dictionary
display(df.head(1))

,Name,Start date of trip,Duration of Visit,Destination,Purpose of trip,Mode of transport,Class of travel,Accomodation/Meals,Other (including hospitality given),"Total cost, including all visas, accommodation, travel, meals etc. (£)",Total Cost of Use of Official Secure Car
0,Gareth Bayley,2018-01-15,4,Bristol,To complete SAFE+ training,Rail,Economy,Nil Return,257.19,211.4,Nil Return

,Name,Start date of trip,Duration of Visit,Destination,Purpose of trip,Mode of transport,Class of travel,Accommodation and Meals,Other,Total cost,Total Cost of Use of Official Secure Car
0,Gareth Bayley,2018-01-15,4,Bristol,To complete SAFE+ training,Rail,Economy,Nil Return,257.19,211.4,Nil Return

### Data Cleaning using `replace()`

Notice that some columns should be stored as `int`s or `float`s, but are shown to be stored as the `object` datatype. The next part will be data cleaning so that the data is ready for analysis.

Convert the `Duration of Visit` column to an `int` datatype so numerical analysis can be performed using `np.int`. Observe how this line throws a `ValueError` when applying `np.int` because some records have `Nil Return` as the value.

In [9]:
# Exercise: Find the unique values of the 'Duration of Visit' column
df['Duration of Visit'].unique()

array(['4', '1', '10', '2', '3', '5', '6', 'Nil Return', '17', '8', '11',
       '7'], dtype=object)

In [10]:
# Uncomment this line of code and run it. A ValueError will be raised.
df['Duration of Visit'].apply(np.int)

ValueError: invalid literal for int() with base 10: 'Nil Return'

To overcome this, use `replace()` to substitute all `Nil Return` values to `0`.

In [20]:
# Make a copy of this df and store this as df_cl
df_cl = df.copy()

# print() the dtypes
print(df_cl.dtypes)

Name                                        object
Start date of trip                          object
Duration of Visit                           object
Destination                                 object
Purpose of trip                             object
Mode of transport                           object
Class of travel                             object
Accommodation and Meals                     object
Other                                       object
Total cost                                  object
Total Cost of Use of Official Secure Car    object
dtype: object

In [26]:
# Use replace ('source', target) to replace values in the Series
df_cl['Duration of Visit'] = df_cl['Duration of Visit'].replace('Nil Return', "0")

# Now, np.int can be applied. The datatype of the column has also been updated.
df_cl['Duration of Visit'] = df_cl['Duration of Visit'].apply(np.int)
# Exercise: print the datatypes of the df using dtypes
#
df_cl.dtypes

Name                                        object
Start date of trip                          object
Duration of Visit                            int64
Destination                                 object
Purpose of trip                             object
Mode of transport                           object
Class of travel                             object
Accommodation and Meals                     object
Other                                       object
Total cost                                  object
Total Cost of Use of Official Secure Car    object
dtype: object

Do the same for the `Accommodation and Meals`, `Other` and `Total cost` columns.

**Q:** Find all the unique values in the following columns: `Accommodation and Meals`, `Other` and `Total cost`

In [ ]:
# Exercise: Find the unique values for the 'Accommodation and Meals', 'Other' and 'Total cost' column.
# 'Accommodation and Meals' column
#

# 'Other' column
#

# 'Total cost' column
#

To replace multiple values, use `replace(list, 0)`. The first parameter is now a `list` instead of a `str` as seen earlier.

In [ ]:
# Perform the substitution for Accommodation and Meals
#

In [ ]:
# Perform the substitution for 'Other'. Then convert the column to a float datatype using np.float.
#

# print the unique values of this column after substitution
#

In [ ]:
# Exercise: Perform the substitution for 'Total Cost'. Then convert the column to a float datatype.
#
# print the unique values of this column after substitution
#

Now, only keep certain columns for analysis. Use `df.drop()` to remove the column name. Since we are dropping a column, use `axis=1` to specify that.

In [ ]:
# Drop the 'Total Cost of Use of Official Secure Car' column
#

Observe the `df` one more time after data cleaning before doing analysis. Observe now that the datatypes have now been updated.

In [ ]:
# Exercise: Show the properties of the df using info()
#

### Data Aggregation with `.size()`

**Q:  How many delegates have taken $5$ or more trips?**

Use the `DataFrame.groupby()` method to first aggregate the data by the `Name` column. Then, since we are **counting** the number of trips made, we use the `size()` method to count the number of trips per delegate.

Finally, use `reset_index(name='No. of Trips')` to convert this to a `DataFrame` and changing the count column to `'No. of Trips'`.

In [32]:
# Exercise: Make a copy of df_cl and store them as df_days
#
df_days = df.copy()
# Exercise: For each delegate, count the number of trips taken.
#
df_days = df_days.groupby('Name').size().reset_index(name = 'No. of Trips')

df_days
# Then perform df.reset_index() to change the column name to 'No. of Trips'
#
# Observe the df here
#

                     Name  No. of Trips
0        Alastair McPhail             1
1            Andrew Noble             1
2        Andrew Sanderson             2
3            Andy Murdoch             4
4           Angus Lapsley            11
5             Ben Merrick             5
6         Caroline Wilson             7
7             Charles Hay             1
8   Colin Martin-Reynolds             5
9           Edward Hobart             4
10          Gareth Bayley             8
11         Geoffrey Adams             1
12     Helen Bower-Easton             3
13           Hugh Elliott             2
14           Iain Macleod             6
15          James Kariuki             1
16         Jane Marriott              5
17           Jill Gallard             2
18           Joanna Roper             4
19           Jon Benjamin             1
20     Jonanthan Sinclair             1
21       Julia Longbottom             3
22              Kara Owen             3
23           Karen Pierce             6
24             Kate White             2
25             Lewis Neal             1
26         Liane Saunders             7
27        Lindsay Appleby             5
28          Martin Harris             6
29          Neil Crompton             3
30             Neil Wigan             6
31          Patrick Moody             1
32            Paul McKell             1
33          Paul Williams             3
34            Peter Jones             6
35          Philip Barton             2
36           Robin Grimes             4
37            Shamik Dhar             3
38         Simon McDonald             7
39        Simon Shercliff             1
40              Tim Dowse             1
41      Tracey Williamson             1

Now that we have the required dataframe, filter for all records where the `No. of Trips` is $5$ or greater. Use `DataFrame['Name'].count()` after performing the filtering to get the number of delegates.

In [33]:
# Exercise: Complete the code to get delegates with 5 or more trips
df_days = df_days[df_days['No. of Trips'] >= 5]
df_days

                     Name  No. of Trips
4           Angus Lapsley            11
5             Ben Merrick             5
6         Caroline Wilson             7
8   Colin Martin-Reynolds             5
10          Gareth Bayley             8
14           Iain Macleod             6
16         Jane Marriott              5
23           Karen Pierce             6
26         Liane Saunders             7
27        Lindsay Appleby             5
28          Martin Harris             6
30             Neil Wigan             6
34            Peter Jones             6
38         Simon McDonald             7

### More Data Aggregation with `.agg()`

**Q: Which delegates have made $5$ trips or more, but have travelled a total of less than $10$ days?**

**Worked Solution**: Make a copy of the `df` and isolate two columns - `Name` and `Duration of Visit` as they are required for our analysis. Remove all records where the value for `Duration of Visit` is `'Nil Return'`. Finally, convert the column to an `int` datatype using `np.int`.

In [ ]:
# Exercise: Make a copy of the df and store them in df_trips
#
# Then, only keep the required columns
#
# Filter for all records that have 'Nil Return' in the 'Duration of Visit' column
# (Perform this step if you are using the dataset that is not cleaned.)
#
# Convert the 'Duration of Visit' column to an int datatype
#

Perform the aggregation using `groupby()`. Then, use the `agg()` function to perform multiple aggregations on the same column. `agg` takes a `dict` as a parameter where the **key** is the **name of the column** and the **value** is the `list` of functions we intend to aggregate for.

In [ ]:
# Use groupby() followed by agg(). Then, reset_index()
#
# print out the result
#

Observe that the column has multiple layers of labelling / indexing. Flatten the index to just 1 layer of columns. Follow [this StackOverflow answer](https://stackoverflow.com/questions/14507794/python-pandas-how-to-flatten-a-hierarchical-index-in-columns) to find more ways to flatten a multi-indexed `df`.

In [ ]:
# Flatten the index using pd.Index and assigning them to the columns
df_count_sum_aggregate.columns = pd.Index(['Name', 'Number of Days', 'Number of Trips'])
df_count_sum_aggregate.head()

Finally with the results, filter using 2 conditions: where the number of trips is 5 or more but the number of days is less than 10.

In [ ]:
# Exercise: Filter using the 'Number of Trips' and 'Number of Days' columns
#

### Self-Study - Drawing Pivot Tables

**Q: ** Create a pivot table where:
1. each row represents one delegate
2. each column represents trip duration in days 
3. each value in the cell is the number of trips with that duration.

Perform this for all trips where the `Duration of Visit` is $5$ **days or less**.

First, create a copy of `df_trips` and store them in `df_pt_raw`. Filter for all trips with $5$ days or less.

In [ ]:
# Create a copy of df_trips
#
# Filter for all trips with 5 days or less
#

Then, create the table using the `pd.pivot_table()` function. Specify the `index`, `columns`, `values` and `aggfunc` accordingly.

In [ ]:
# Create the pivot table using pd.pivot_table() 
#
# Add the Name as 1 column in the df
#
# reset_index
#

Change the datatypes and order of the columns and finally convert every value in the column to an integer.

In [ ]:
# Display the columns. Note that the values for the numeric columns are of type int, not string.
#

In [ ]:
# Change the datatype of the columns.
#
# Change the order of the columns
#

In [ ]:
# Substitute all values with NaN to 0
#
# Convert all the columns to integers
#

**Exercise**
Using `pokemon.csv`, Create a pivot table where
1. each row represents the type of Pokémon
2. one column representing all Legendary Pokémon and one column representing Non Legendary Pokémon
3. each value in the cell is the count(number) of Pokémon of Legendary status and Non Legendary status, for each type

Perform this for only Pokémon with ID is $151$ or less. Use `aggfunc=np.sum` for this aggregation.

In [ ]:
# Read from CSV file
#

# Isolate the Pokemon_ID, Type and Legendary column
#

# Filter for all Pokemon_ID <= 151
#

# Perform a groupby and count the number of Pokemon in each type, for each Legendary status
#

# Rename the columns

# Create the pivot table where the row is the Type and the column is the Legendary status

# Fill all missing cells to 0

# Convert the cells datatype to int

# Update the column names

# Add one more column and reset the column

# Show the df

**Credits**
- [data.gov.uk](https://www.europeandataportal.eu/data/en/dataset/travel-undertaken-by-fco-senior-staff) for the Foreign and Commonwealth Office's travel expenses dataset

- [Pokemon with stats, Kaggle](https://www.kaggle.com/abcsds/pokemon) for the Pokémon dataset
<hr>
`HWA-DS102-INCLASS-2C-201903`